In [56]:
import pandas as pd
import numpy as np

# Пересчитаем число ног у героев игры Dota2! Сгруппируйте героев из датасэта по числу их ног (колонка legs), и заполните их число в задании ниже.

In [57]:
df = pd.read_csv('data/dota_hero_stats.csv')

In [58]:
df.head()

,Unnamed: 0,attack_type,id,legs,localized_name,name,primary_attr,roles
0,0,Melee,1,2,Anti-Mage,npc_dota_hero_antimage,agi,"['Carry', 'Escape', 'Nuker']"
1,1,Melee,2,2,Axe,npc_dota_hero_axe,str,"['Initiator', 'Durable', 'Disabler', 'Jungler']"
2,2,Ranged,3,4,Bane,npc_dota_hero_bane,int,"['Support', 'Disabler', 'Nuker', 'Durable']"
3,3,Melee,4,2,Bloodseeker,npc_dota_hero_bloodseeker,agi,"['Carry', 'Disabler', 'Jungler', 'Nuker', 'Ini..."
4,4,Ranged,5,2,Crystal Maiden,npc_dota_hero_crystal_maiden,int,"['Support', 'Disabler', 'Nuker', 'Jungler']"

In [59]:
df.shape

(117, 8)

In [60]:
df.groupby('legs').count()

      Unnamed: 0  attack_type  id  localized_name  name  primary_attr  roles
legs
0             11           11  11              11    11            11     11
2             95           95  95              95    95            95     95
4              7            7   7               7     7             7      7
6              3            3   3               3     3             3      3
8              1            1   1               1     1             1      1

# альтернативные решения

In [61]:
df.legs.value_counts()

2    95
0    11
4     7
6     3
8     1
Name: legs, dtype: int64

In [62]:
df.groupby('legs').size()

legs
0    11
2    95
4     7
6     3
8     1
dtype: int64

In [63]:
df.aggregate({'legs': 'value_counts'}).sort_index()

   legs
0    11
2    95
4     7
6     3
8     1

In [64]:
df.groupby(['legs']).id.nunique()

legs
0    11
2    95
4     7
6     3
8     1
Name: id, dtype: int64

In [65]:
[len(df[df.legs == i]) for i in [0,2,4,6,8]]

[11, 95, 7, 3, 1]

In [66]:
df.groupby('legs').describe()

     Unnamed: 0                                                         id  \
          count       mean        std   min   25%   50%   75%    max count
legs
0          11.0  46.000000  32.227318   9.0  20.0  38.0  76.0   92.0  11.0
2          95.0  58.789474  34.307091   0.0  29.5  58.0  86.5  116.0  95.0
4           7.0  61.714286  31.721256   2.0  53.0  61.0  84.0   95.0   7.0
6           3.0  68.000000  46.679760  15.0  50.5  86.0  94.5  103.0   3.0
8           1.0  59.000000        NaN  59.0  59.0  59.0  59.0   59.0   1.0


           mean        std   min   25%   50%   75%    max
legs
0     47.727273  32.554849  10.0  21.5  40.0  78.0   94.0
2     60.842105  34.994928   1.0  31.5  60.0  88.5  129.0
4     63.571429  32.035694   3.0  55.0  63.0  86.0   97.0
6     69.666667  47.247575  16.0  52.0  88.0  96.5  105.0
8     61.000000        NaN  61.0  61.0  61.0  61.0   61.0

# К нам поступили данные из бухгалтерии о заработках Лупы и Пупы за разные задачи! Посмотрите у кого из них больше средний заработок в различных категориях (колонка Type) и заполните таблицу, указывая исполнителя с большим заработком в каждой из категорий.

In [67]:
df = pd.read_csv('data/accountancy.csv')

In [68]:
df.head()

   Unnamed: 0 Executor Type  Salary
0           0     Pupa    D      63
1           1     Pupa    A     158
2           2     Pupa    D     194
3           3     Pupa    E     109
4           4    Loopa    E     184

In [69]:
df.groupby(['Executor', 'Type'], as_index=False).aggregate({'Salary': 'mean'})

   Executor Type      Salary
0     Loopa    A   58.000000
1     Loopa    B  145.166667
2     Loopa    C  154.333333
3     Loopa    D  137.714286
4     Loopa    E  164.000000
5     Loopa    F  238.000000
6      Pupa    A  160.833333
7      Pupa    B   77.000000
8      Pupa    C   74.500000
9      Pupa    D  146.500000
10     Pupa    E  131.200000
11     Pupa    F  136.250000

# Альтернативные решения

In [70]:

df.drop('Unnamed: 0', axis=1)\
    .groupby(['Type', 'Executor'], as_index=False)\
    .mean()\
    .sort_values(['Type', 'Salary'], ascending=[True, False])\
    .groupby('Type')\
    .head(1)

   Type Executor      Salary
1     A     Pupa  160.833333
2     B    Loopa  145.166667
4     C    Loopa  154.333333
7     D     Pupa  146.500000
8     E    Loopa  164.000000
10    F    Loopa  238.000000

In [71]:
df.groupby(['Type','Executor']).mean().unstack()

         Unnamed: 0             Salary
Executor      Loopa   Pupa       Loopa        Pupa
Type
A         46.000000  16.00   58.000000  160.833333
B         24.000000  41.00  145.166667   77.000000
C         31.666667  23.00  154.333333   74.500000
D         31.857143  14.00  137.714286  146.500000
E         23.500000  19.80  164.000000  131.200000
F         20.000000  25.75  238.000000  136.250000

In [72]:
df.pivot_table(values = "Salary", index = "Executor", columns = "Type")

Type               A           B           C           D      E       F
Executor
Loopa      58.000000  145.166667  154.333333  137.714286  164.0  238.00
Pupa      160.833333   77.000000   74.500000  146.500000  131.2  136.25

In [73]:
(df[df['Executor']=='Pupa'].groupby(['Type']).mean())>(df[df['Executor']=='Loopa'].groupby(['Type']).mean())

      Unnamed: 0  Salary
Type
A          False    True
B           True   False
C          False   False
D          False    True
E          False   False
F           True   False

In [74]:
df.sort_values('Salary', ascending=False).groupby('Type').head(1).sort_values('Type')

    Unnamed: 0 Executor Type  Salary
19          19     Pupa    A     234
6            6    Loopa    B     249
44          44    Loopa    C     249
2            2     Pupa    D     194
42          42    Loopa    E     220
35          35    Loopa    F     244

In [75]:
df.groupby(['Executor','Type']).aggregate({'Salary': 'mean'}).unstack(level=0)

              Salary
Executor       Loopa        Pupa
Type
A          58.000000  160.833333
B         145.166667   77.000000
C         154.333333   74.500000
D         137.714286  146.500000
E         164.000000  131.200000
F         238.000000  136.250000

In [76]:
# Мб не оптимальный, но удобный способ:
#
# Берётся сводная таблица, аггрегирующая среднее значение для формата "индексы - тип, столбцы - исполнитель";
# Определяется индекс максимального значения в каждой строке .idxmax(axis=1);
# Из каждого индекса берётся только та часть, которая содержит значение исполнителя.
df.pivot_table(index=['Type'],
               columns=['Executor'],
               aggfunc='mean').idxmax(axis='columns').map(lambda val: val[1])

Type
A     Pupa
B    Loopa
C    Loopa
D     Pupa
E    Loopa
F    Loopa
dtype: object

In [77]:
df.pivot_table('Salary', 'Type', 'Executor')

Executor       Loopa        Pupa
Type
A          58.000000  160.833333
B         145.166667   77.000000
C         154.333333   74.500000
D         137.714286  146.500000
E         164.000000  131.200000
F         238.000000  136.250000

In [78]:
pd.crosstab(df.Type, df.Executor, df.Salary, aggfunc='mean')

Executor       Loopa        Pupa
Type
A          58.000000  160.833333
B         145.166667   77.000000
C         154.333333   74.500000
D         137.714286  146.500000
E         164.000000  131.200000
F         238.000000  136.250000

In [79]:
df.drop('Unnamed: 0', axis='columns').groupby(['Type', 'Executor']).max()

               Salary
Type Executor
A    Loopa         58
     Pupa         234
B    Loopa        249
     Pupa          77
C    Loopa        249
     Pupa          94
D    Loopa        181
     Pupa         194
E    Loopa        220
     Pupa         197
F    Loopa        244
     Pupa         195

In [80]:
df.groupby(['Type', 'Executor']).mean()['Salary']

Type  Executor
A     Loopa        58.000000
      Pupa        160.833333
B     Loopa       145.166667
      Pupa         77.000000
C     Loopa       154.333333
      Pupa         74.500000
D     Loopa       137.714286
      Pupa        146.500000
E     Loopa       164.000000
      Pupa        131.200000
F     Loopa       238.000000
      Pupa        136.250000
Name: Salary, dtype: float64

# Продолжим исследование героев Dota2. Сгруппируйте по колонкам attack_type и primary_attr и выберите самый распространённый набор характеристик.

In [92]:
heroes = pd.read_csv('data/dota_hero_stats.csv')
heroes.shape

(117, 8)

In [93]:
heroes['one'] = [1 for _ in range(heroes.shape[0])]
heroes.head()

,Unnamed: 0,attack_type,id,legs,localized_name,name,primary_attr,roles,one
0,0,Melee,1,2,Anti-Mage,npc_dota_hero_antimage,agi,"['Carry', 'Escape', 'Nuker']",1
1,1,Melee,2,2,Axe,npc_dota_hero_axe,str,"['Initiator', 'Durable', 'Disabler', 'Jungler']",1
2,2,Ranged,3,4,Bane,npc_dota_hero_bane,int,"['Support', 'Disabler', 'Nuker', 'Durable']",1
3,3,Melee,4,2,Bloodseeker,npc_dota_hero_bloodseeker,agi,"['Carry', 'Disabler', 'Jungler', 'Nuker', 'Ini...",1
4,4,Ranged,5,2,Crystal Maiden,npc_dota_hero_crystal_maiden,int,"['Support', 'Disabler', 'Nuker', 'Jungler']",1

In [100]:
heroes.groupby(['attack_type', 'primary_attr'], as_index=False)\
    .count()\
    .sort_values(['one'], ascending=False)[['attack_type', 'one']]

  attack_type  one
4      Ranged   40
2       Melee   35
0       Melee   19
3      Ranged   18
5      Ranged    3
1       Melee    2

In [102]:
heroes.filter(items=['attack_type', 'primary_attr']).mode()

  attack_type primary_attr
0      Ranged          int

In [103]:
heroes[['attack_type', 'primary_attr']].mode()

  attack_type primary_attr
0      Ranged          int

In [104]:
df = heroes
df[['attack_type', 'primary_attr']].mode()

  attack_type primary_attr
0      Ranged          int

### Аспирант Ростислав изучает метаболом водорослей и получил такую табличку. В ней он записал вид каждой водоросли, её род (группа, объединяющая близкие виды), группа (ещё одно объединение водорослей в крупные фракции) и концентрации анализируемых веществ.
Помогите Ростиславу найти среднюю концентрацию каждого из веществ в каждом из родов (колонка genus)! Для этого проведите группировку датафрэйма, сохранённого в переменной concentrations, и примените метод, сохранив результат в переменной mean_concentrations.

In [114]:
concentrations = pd.read_csv('data/algae.csv')
concentrations

,species,genus,group,sucrose,alanin,citrate,glucose,oleic_acid
0,Fucus_vesiculosus,Fucus,brown,3.001472,3.711498,5.004262,2.548459,6.405165
1,Saccharina_japonica,Saccharina,brown,6.731070,1.255251,5.621499,6.013219,4.156700
2,Fucus_serratus,Fucus,brown,3.276870,0.346431,1.216767,3.623225,0.304573
3,Fucus_distichus,Fucus,brown,6.786996,6.641303,6.423606,2.272724,3.393203
4,Cladophora_fracta,Cladophora,green,3.861470,1.648450,6.940588,2.316955,2.528886
5,Cladophora_compacta,Cladophora,green,5.712284,3.461692,3.082826,3.343707,1.432514
6,Cladophora_gracilis,Cladophora,green,2.452623,6.881024,5.841520,2.740165,2.829016
7,Palmaria_palmata,Palmaria,red,0.704580,3.176440,5.573905,3.242090,2.245538
8,Saccharina_latissima,Saccharina,brown,1.636122,5.793163,1.071920,3.947968,4.817804
9,Ascophyllum_nodosum,Ascophyllum,brown,6.825467,0.875429,5.253527,3.414961,2.432526

In [115]:
concentrations.groupby('genus').mean()

              sucrose    alanin   citrate   glucose  oleic_acid
genus
Ascophyllum  6.825467  0.875429  5.253527  3.414961    2.432526
Cladophora   4.008792  3.997055  5.288311  2.800276    2.263472
Fucus        4.355112  3.566411  4.214878  2.814803    3.367647
Palmaria     0.704580  3.176440  5.573905  3.242090    2.245538
Saccharina   4.183596  3.524207  3.346710  4.980594    4.487252

In [196]:
mean_concentrations = concentrations.groupby('genus').mean()

### Пользуясь предыдущими данными, укажите через пробел (без запятых) чему равны минимальная, средняя и максимальная концентрации аланина (alanin) среди видов рода Fucus. Округлите до 2-ого знака, десятичным разделителем является точка.
### Формат ответа:
### 0.55 6.77 7.48

In [210]:
# Мое решение "0.35 3.57 6.64"
min_mean_max = concentrations[concentrations.genus == 'Fucus']['alanin'].describe().round(2)[['min','mean','max']]
print(min_mean_max[0], min_mean_max[1], min_mean_max[2])

0.35 3.57 6.64

In [206]:
concentrations.describe()

         sucrose     alanin    citrate    glucose  oleic_acid
count  10.000000  10.000000  10.000000  10.000000   10.000000
mean    4.098895   3.379068   4.603042   3.346347    3.054593
std     2.271190   2.400529   2.084948   1.094572    1.739319
min     0.704580   0.346431   1.071920   2.272724    0.304573
25%     2.589835   1.353551   3.563185   2.596385    2.292285
50%     3.569170   3.319066   5.413716   3.292899    2.678951
75%     6.476373   5.272747   5.786515   3.571159    3.965826
max     6.825467   6.881024   6.940588   6.013219    6.405165

In [194]:
concentrations.query("genus == 'Fucus'")['alanin'].round(2)

0    3.71
2    0.35
3    6.64
Name: alanin, dtype: float64

In [192]:
fucus_alian = concentrations.query("genus == 'Fucus'")['alanin'].round(2)
print(f'{fucus_alian[2]} {round(fucus_alian.mean(), 2)} {fucus_alian[3]}')

0.35 3.57 6.64

## Сгруппируйте данные по переменной group и соотнесите вопросы с ответами

In [212]:
concentrations.head()

,species,genus,group,sucrose,alanin,citrate,glucose,oleic_acid
0,Fucus_vesiculosus,Fucus,brown,3.001472,3.711498,5.004262,2.548459,6.405165
1,Saccharina_japonica,Saccharina,brown,6.731070,1.255251,5.621499,6.013219,4.156700
2,Fucus_serratus,Fucus,brown,3.276870,0.346431,1.216767,3.623225,0.304573
3,Fucus_distichus,Fucus,brown,6.786996,6.641303,6.423606,2.272724,3.393203
4,Cladophora_fracta,Cladophora,green,3.861470,1.648450,6.940588,2.316955,2.528886

In [213]:
# Мои три решения:
# Число видов бурых, зелёных и красных водорослей
concentrations.groupby('group').aggregate('count')

       species  genus  sucrose  alanin  citrate  glucose  oleic_acid
group
brown        6      6        6       6        6        6           6
green        3      3        3       3        3        3           3
red          1      1        1       1        1        1           1

In [216]:
# Дисперсия концентрации цитрата в бурых, зелёных и красных водорослях
concentrations.groupby('group')['citrate'].aggregate('var').round(2)

group
brown    5.47
green    3.95
red       NaN
Name: citrate, dtype: float64

In [221]:
# Размах (максимум - минимум) сахарозы в бурых, зелёных и красных водорослях
(concentrations.groupby('group')['sucrose'].aggregate('max') - concentrations.groupby('group')['sucrose'].aggregate('min')).round(2)

group
brown    5.19
green    3.26
red      0.00
Name: sucrose, dtype: float64

In [222]:
# Удобная функция для расчета размаха np.ptp
concentrations.groupby('group')['sucrose'].aggregate(np.ptp).round(2)

group
brown    5.19
green    3.26
red      0.00
Name: sucrose, dtype: float64